---
kind: method
id: M:Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorPlanColor(Autodesk.Revit.DB.Color)
source: html/76967b6f-b1a2-7c29-7327-a368a52a2196.htm
---
# Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorPlanColor Method

Sets the color of the open connector indicator in plan view.

## Syntax (C#)
```csharp
public static void SetOpenConnectorIndicatorPlanColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null